TEDS-2023/Práctica 8/Práctica 8.tex
% Created 2023-10-31 mar 19:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{~/.emacs.d/templates/modern.sty}
\bibliography{fuentes.bib}
\setcounter{secnumdepth}{2}
\author{Luis Eduardo Galindo Amaya (1274895)}
\date{lunes, 30 octubre 2023}
\title{Práctica 8. Investigación Diseño Web}
\hypersetup{
 pdfauthor={Luis Eduardo Galindo Amaya (1274895)},
 pdftitle={Práctica 8. Investigación Diseño Web},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={Spanish}}
\begin{document}

\makeatletter
\makeatletter
\modentitlepage{~/.emacs.d/templates/img/tinta.png}
\tableofcontents
\pagebreak
\datasection{Individual}

\section{Introducción}
\label{sec:org85d6944}
Durante esta practica investigaremos que es el diseño web y como se relaciona
con la ingeniería en software, para que sirve y como hacer buenas interfaces.

\section{¿Qué es?}
\label{sec:org82e4fe4}
\autocite{sanchez_2022} El diseño web es una disciplina enfocada en la 
planificación, ideación, creación e implementación de interfaces y plataformas 
digitales. En otras palabras, el diseño web es el proceso que engloba todos los 
elementos necesarios para crear páginas web.

\section{¿Para qué sirve el diseño web?}
\label{sec:org528c002}
\autocite{sanchez_2022} El diseño web agrupa y cohesiona la imagen de
marca, los valores corporativos y el mensaje de la empresa y los plasma en 
forma de una página web visual y atrayente

\section{¿Qué es responsive design?}
\label{sec:org78dcf97}
\autocite{pallerols_2022} El Responsive Design o diseño adaptativo es la
técnica que se usa en la actualidad para tener una misma web adaptada a las 
diferentes plataformas que nos brinda la tecnología: ordenador, tablet, 
Smartphone, iPad, Kindle y, en resumen, todas las resoluciones de pantalla 
existentes.

\section{¿Qué hace un diseñador web?}
\label{sec:orgc6d7d28}
\autocite{Dias_Dourado_2021} Los diseñadores web tienen en su trabajo 
tareas rutinarias relacionadas con la creación de un diseño para medios 
digitales y la creación de contenido. Por lo tanto, deben analizar tanto las 
necesidades del cliente como los objetivos para configurar un sitio web a fin 
de brindar a los visitantes la mejor experiencia. Además, diseñadores web deben
saber cómo insertar gráficos, usar lenguajes como HTML y actualizar el sitio 
cuando sea necesario. Ahora que has permanecido con nosotros hasta el final del
texto, ya sabes qué perfil debe tener un buen profesional de diseño web. 

\section{Conclusion}
\label{sec:orga39e886}
A lo largo de esta investigación aprendí como el diseño web permite crear 
productos de software de calidad, los diseñadores web permiten presentar
un producto de mayor calidad. Las herramientas web modernas nos permiten crear
aplicaciones de mayor calidad en menor tiempo y para una mayor cantidad de 
dispositivos.


\section{Referencias}
\label{sec:orgce28412}
\printbibliography[heading=none]
\end{document}
